//============================================================================
// 
// PUSHUI [push.cpp]
// Author : 久保市篤武
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "push.h"// タイトルロゴヘッダーファイル

//============================================================================
// コンストラクタ
//============================================================================
CPush::CPush(int nPriority) : CObject_2D{ nPriority }
{
	//メンバ変数初期化
	m_bLightUp = false;//ライトアップフラグ
}

//============================================================================
// デストラクタ
//============================================================================
CPush::~CPush()
{
}

//============================================================================
// 初期設定
//============================================================================
HRESULT CPush::Init()
{
	// テクスチャ設定
	BindTex(CTexture_Manager::TYPE::PUSH);

	// 2Dオブジェクト初期設定
	if (FAILED(CObject_2D::Init()))
	{
		return E_FAIL;
	}

	return S_OK;
}

//============================================================================
// 終了処理
//============================================================================
void CPush::Uninit()
{
	// 2Dオブジェクト終了処理
	CObject_2D::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CPush::Update()
{
	//ローカル変数宣言
	D3DXCOLOR color = GetCol();//カラー情報

	//明るくなっている場合
	if (m_bLightUp)
	{
		color.a += STAND_SPEED;
	}
	//暗くなっている場合
	else
	{
		color.a -= STAND_SPEED;
	}

	//カラーのα値が最大・最小値に達した場合
	if (color.a <= 0.0f || color.a >= 1.0f)
	{
		//ライトアップフラグを切り替える
		m_bLightUp = m_bLightUp ? false : true;
	}

	//更新情報設定
	SetCol(color);//カラー情報

	// 2Dオブジェクト更新処理
	CObject_2D::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CPush::Draw()
{
	// 2Dオブジェクト描画処理
	CObject_2D::Draw();
}

//============================================================================
// 生成処理
//============================================================================
CPush* CPush::Create()
{
	// メモリを動的確保
	CPush* pPush = new CPush();

	// パラメータ設定
	pPush->SetSize(CREATE_SIZE);// サイズ
	pPush->SetPos(CREATE_POS);// 座標

	// 初期化処理
	pPush->Init();

	return pPush;
}
