//============================================================================
// 
// タイマー表示 [timernumber.cpp]
// Author : 久保市篤武
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "timernumber.h"//タイマーナンバーヘッダーファイル
#include "timer.h"//タイマー管理ヘッダーファイル
#include <manager.h>//マネージャーヘッダーファイル

//============================================================================
// コンストラクタ
//============================================================================
CTimerNumber::CTimerNumber(int nPriority) : CObject_2D{ nPriority }
{
}

//============================================================================
// デストラクタ
//============================================================================
CTimerNumber::~CTimerNumber()
{
}

//============================================================================
// 初期設定
//============================================================================
HRESULT CTimerNumber::Init()
{
	// 2Dオブジェクト初期設定
	if (FAILED(CObject_2D::Init()))
	{
		return E_FAIL;
	}

	return S_OK;
}

//============================================================================
// 終了処理
//============================================================================
void CTimerNumber::Uninit()
{
	// 2Dオブジェクト終了処理
	CObject_2D::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CTimerNumber::Update()
{
	// ローカル変数宣言
	int nTimer = CManager::GetTimer()->GetTime();// 現在のタイマー
	int nMulti = 1;// 各桁の倍数

	//IDに合わせて倍数を求める
	for (int nCntTime = 0; nCntTime < m_nIdx; nCntTime++)
	{
		nMulti *= 10;
	}

	//該当する桁の数字を求める
	int nPosTex = (nTimer % nMulti) / (nMulti / 10);

	// 2Dオブジェクト更新処理
	CObject_2D::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CTimerNumber::Draw()
{
	// 2Dオブジェクト描画処理
	CObject_2D::Draw();
}

//============================================================================
// 生成処理
//============================================================================
CTimerNumber* CTimerNumber::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, int nIdx)
{
	// メモリを動的確保
	CTimerNumber* pTimeNumber = new CTimerNumber();

	//パラメータ設定
	pTimeNumber->SetIdx(nIdx);// ID
	pTimeNumber->SetSize(size);// サイズ
	pTimeNumber->SetTimerNumberPos(pos);// 座標
	pTimeNumber->SetTexWidth(10.0f);// 横のテクスチャ分割数

	//初期化処理
	pTimeNumber->Init();

	return nullptr;
}

//============================================================================
// 座標設定
//============================================================================
void CTimerNumber::SetTimerNumberPos(D3DXVECTOR3 pos)
{
	SetPos({ pos.x + m_nIdx * (GetSize().x * 0.5f), pos.y, pos.z });
}
