//============================================================================
// 
// タイマー、ヘッダファイル [timer.h]
// Author : 久保市篤武
// 
//============================================================================

#ifndef _TIMER_H_
#define _TIMER_H_	// 二重インクルード防止

//****************************************************
// インクルードファイル
//****************************************************

//****************************************************
// タイマークラス
//****************************************************
class CTimer
{
public:

	CTimer();	// コンストラクタ
	~CTimer();	// デストラクタ

	HRESULT Init();	// 初期設定
	void Uninit();	// 終了処理
	void Update();	// 更新処理

	int GetTime() { return m_nTimer; }	//タイマーの取得

private:

	int m_nCntFrame;	// フレームカウンタ
	int m_nTimer;		// タイマー
	int m_nDigit;		// 桁数
};

#endif // _TIMER_H_
