//============================================================================
// 
// タイトル [title.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "title.h"

// インプット取得用
#include "manager.h"

#include "renderer.h"

/* test */
#include "object_2D.h"
#include "texture_manager.h"
#include <bg.h>
#include <logo.h>
#include <push.h>

//============================================================================
// コンストラクタ
//============================================================================
CTitle::CTitle()
{

}

//============================================================================
// デストラクタ
//============================================================================
CTitle::~CTitle()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CTitle::Init()
{
	// 基底クラスの初期設定
	HRESULT hr{ CScene::Init() };

	// 背景生成
	CBg::Create();

	// タイトルロゴ生成
	CLogo::Create();

	// PUSHUI生成
	CPush::Create();

	// 全てのサウンドを停止
	//CSound::GetInstance()->Stop();

	// BGMをかける
	//CSound::GetInstance()->Play(CSound::LABEL::TEST);

	return hr;
}

//============================================================================
// 終了処理
//============================================================================
void CTitle::Uninit()
{
	// 基底クラスの終了処理
	CScene::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CTitle::Update()
{
	// 基底クラスの更新処理
	CScene::Update();

	// チュートリアル画面へ
	if (CManager::GetKeyboard()->GetTrigger(DIK_RETURN)
		|| CManager::GetPad()->GetTrigger(CInputPad::JOYKEY::START))
	{
		CFade::SetFade(CScene::MODE::TUTORIAL);
	}
}

//============================================================================
// 描画処理
//============================================================================
void CTitle::Draw()
{
	// 基底クラスの描画処理
	CScene::Draw();
}