//============================================================================
// 
// チュートリアル [tutorial.cpp]
// Author : 久保市篤武
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "tutorial.h"

// インプット取得用
#include "manager.h"

#include "renderer.h"

/* test */
#include "object_2D.h"
#include "texture_manager.h"
#include <bg.h>
#include <explanation.h>
#include "sound.h"
//============================================================================
// コンストラクタ
//============================================================================
CTutorial::CTutorial()
{

}

//============================================================================
// デストラクタ
//============================================================================
CTutorial::~CTutorial()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CTutorial::Init()
{
	// 基底クラスの初期設定
	HRESULT hr{ CScene::Init() };

	// 背景生成
	CBg::Create();

	// 操作説明画面生成
	CExplanation::Create();

	// BGMをかける
	CSound::GetInstance()->Play(CSound::LABEL::BGM_01);
	return hr;
}

//============================================================================
// 終了処理
//============================================================================
void CTutorial::Uninit()
{
	// 全てのサウンドを停止
	CSound::GetInstance()->Stop();
	// 基底クラスの終了処理
	CScene::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CTutorial::Update()
{
	// 基底クラスの更新処理
	CScene::Update();

	// ゲーム画面へ
	if (CManager::GetKeyboard()->GetTrigger(DIK_RETURN)
		|| CManager::GetPad()->GetTrigger(CInputPad::JOYKEY::START))
	{
		CSound::GetInstance()->Play(CSound::LABEL::SE_CLICK);
		CFade::SetFade(CScene::MODE::GAME);
	}
}

//============================================================================
// 描画処理
//============================================================================
void CTutorial::Draw()
{
	// 基底クラスの描画処理
	CScene::Draw();
}